In [1]:
import numpy as np
import pandas as pd

## 101 Pandas Exercises for Data Analysis
https://www.machinelearningplus.com/python/101-pandas-exercises-python/

### 2. How to create a series from a list, numpy array and dict?
Create a pandas series from each of the items below: a list, numpy and a dictionary Input

In [8]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [5]:
pd.Series(mylist)

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [6]:
pd.Series(myarr)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int64

In [10]:
mydict

{'a': 0,
 'b': 1,
 'c': 2,
 'e': 3,
 'd': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}

In [11]:
pd.Series(mydict)

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int64

### 3. How to convert the index of a series into a column of a dataframe?
Difficulty Level: L1 Convert the series ser into a dataframe with its index as another column on the dataframe. Input

In [12]:
ser = pd.Series(mydict)

In [30]:
df = pd.DataFrame(ser).reset_index()
df

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

### 4. How to combine many series to form a dataframe?
Difficulty Level: L1 Combine ser1 and ser2 to form a dataframe. Input

In [31]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [32]:
df = pd.DataFrame(ser1, ser2)

In [33]:
df

    0
0   a
1   b
2   c
3   e
4   d
5   f
6   g
7   h
8   i
9   j
10  k
11  l
12  m
13  n
14  o
15  p
16  q
17  r
18  s
19  t
20  u
21  v
22  w
23  x
24  y
25  z

### 5. How to assign name to the series’ index?
Difficulty Level: L1 Give a name to the series ser calling it ‘alphabets’. Input

In [34]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [36]:
ser.index.name = "alphabets"

In [37]:
ser

alphabets
0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

### 6. How to get the items of series A not present in series B?
Difficulty Level: L2 From ser1 remove items present in ser2.

In [111]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [112]:
ser1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [122]:
list1 = list(ser1)
list2 = list(ser2)
list3 = []
for i in list1:
    if not i in list2:
        list3.append(i)
ser1 = pd.Series(list3)
ser1

0    1
1    2
2    3
dtype: int64

### 7. How to get the items not common to both series A and series B?
Difficulty Level: L2 Get all items of ser1 and ser2 not common to both. Input

In [3]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [5]:
ser1[~(ser1.isin(ser2))]

0    1
1    2
2    3
dtype: int64

In [6]:
ser2[~(ser2.isin(ser1))]

2    6
3    7
4    8
dtype: int64

In [8]:
pd.concat([ser1[~(ser1.isin(ser2))], ser2[~(ser2.isin(ser1))]])

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64

### 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
Difficuty Level: L2 Compute the minimum, 25th percentile, median, 75th, and maximum of ser. Input

In [9]:
ser = pd.Series(np.random.normal(10, 5, 25))

In [10]:
ser.min()

-0.25858137237491974

In [12]:
ser.median()

10.16158798346367

In [13]:
ser.max()

18.994861388674515

In [14]:
ser.quantile(0.25)

6.418372271062749

In [15]:
ser.quantile(0.75)

12.233490641753884

In [16]:
np.percentile(ser, 25)

6.418372271062749

### 9. How to get frequency counts of unique items of a series?
Difficulty Level: L1 Calculte the frequency counts of each unique value ser. Input

In [25]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [26]:
ser

0     b
1     f
2     d
3     d
4     e
5     a
6     e
7     h
8     a
9     b
10    g
11    c
12    h
13    h
14    g
15    e
16    g
17    h
18    c
19    f
20    e
21    h
22    h
23    g
24    b
25    g
26    c
27    h
28    f
29    g
dtype: object

In [27]:
ser.value_counts()

h    7
g    6
e    4
c    3
f    3
b    3
d    2
a    2
dtype: int64

ser.value_counts()

### 10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?
Difficulty Level: L2 From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’. Input

In [29]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [43]:
ser

0     4
1     2
2     4
3     2
4     3
5     2
6     4
7     2
8     4
9     1
10    4
11    3
dtype: int64

### 11. How to bin a numeric series to 10 groups of equal size?
Difficulty Level: L2 Bin the series ser into 10 equal deciles and replace the values with the bin name. Input

In [72]:
ser = pd.Series(np.random.random(20))

In [73]:
ser

0     0.391971
1     0.914325
2     0.633611
3     0.346777
4     0.421850
5     0.484389
6     0.702692
7     0.644259
8     0.559063
9     0.367128
10    0.524219
11    0.958697
12    0.169046
13    0.186085
14    0.278389
15    0.238973
16    0.661938
17    0.468721
18    0.619595
19    0.590558
dtype: float64

In [76]:
pd.qcut(ser, 10, labels=["1st", "2nd", "3rd", '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0     4th
1    10th
2     8th
3     3rd
4     4th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

### 12. How to convert a numpy array to a dataframe of given shape? (L1)
Difficulty Level: L1 Reshape the series ser into a dataframe with 7 rows and 5 columns Input

In [78]:
ser = pd.Series(np.random.randint(1, 10, 35))

In [84]:
pd.DataFrame(ser.values.reshape((7,5)))

   0  1  2  3  4
0  2  5  1  5  4
1  9  3  9  1  6
2  5  6  1  7  5
3  9  6  1  8  5
4  4  8  8  2  2
5  1  6  2  6  6
6  6  9  4  8  1

### 13. How to find the positions of numbers that are multiples of 3 from a series?
Difficulty Level: L2 Find the positions of numbers that are multiples of 3 from ser. Input

In [97]:
ser = pd.Series(np.random.randint(1, 10, 7))
ser

0    7
1    1
2    2
3    4
4    7
5    6
6    6
dtype: int64

In [104]:
k=[]
for i in range(len(ser)):
    if i%3==0:
        k.append(ser[i])
pd.Series(k)

0    7
1    4
2    6
dtype: int64

### 14. How to extract items at given positions from a series
Difficulty Level: L1 From ser, extract the items at positions in list pos. Input

In [109]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [110]:
k=[]
for i in pos:
    k.append(ser[i])
pd.Series(k)

0    a
1    e
2    i
3    o
4    u
dtype: object

In [112]:
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

### 15. How to stack two series vertically and horizontally ?
Difficulty Level: L1 Stack ser1 and ser2 vertically and horizontally (to form a dataframe). Input

In [113]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [130]:
pd.DataFrame(ser1.append(ser2))

   0
0  0
1  1
2  2
3  3
4  4
0  a
1  b
2  c
3  d
4  e

In [135]:
pd.DataFrame(pd.concat([ser1, ser2], axis=0, ignore_index=True))

   0
0  0
1  1
2  2
3  3
4  4
5  a
6  b
7  c
8  d
9  e

In [136]:
pd.DataFrame(pd.concat([ser1, ser2], axis=1, ignore_index=True))

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

### 16. How to get the positions of items of series A in another series B?
Difficulty Level: L2 Get the positions of items of ser2 in ser1 as a list. Input

In [157]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [181]:
k=[]
for i in ser2:
    k.append(pd.Index(ser1).get_loc(i))
k

[5, 4, 0, 8]

### 17. How to compute the mean squared error on a truth and predicted series?
Difficulty Level: L2 Compute the mean squared error of truth and pred series. Input

In [182]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [183]:
truth

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [184]:
pred

0    0.728405
1    1.954259
2    2.690309
3    3.815854
4    4.408418
5    5.749679
6    6.215172
7    7.309003
8    8.932138
9    9.465870
dtype: float64

In [185]:
((pred-truth)**2).sum()/len(truth)

0.45398491995257145

### 18. How to convert the first character of each element in a series to uppercase?
Difficulty Level: L2 Change the first character of each word to upper case in each word of ser.

In [188]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [198]:
newser = ser.map(lambda x: x[0].upper() + x[1:])
ser = newser
ser

0     How
1      To
2    Kick
3    Ass?
dtype: object

### 19. How to calculate the number of characters in each word in a series?
Difficulty Level: L2 Input

In [199]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
newser = []
for i in ser:
    newser.append(len(i))
newser

[3, 2, 4, 4]

### 20. How to compute difference of differences between consequtive numbers of a series?
Difficulty Level: L1 Difference of differences between the consequtive numbers of ser. Input

Desired Output

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [201]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [209]:
k=[]
for i in range(len(ser)-1):
    k.append(ser[i+1]-ser[i])
k

[2, 3, 4, 5, 6, 6, 8]

In [210]:
l=[]
for i in range(len(k)-1):
    l.append(k[i+1]-k[i])
l

[1, 1, 1, 1, 0, 2]

### 21. How to convert a series of date-strings to a timeseries?
Difficiulty Level: L2 Input

Desired Output

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [215]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [216]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

### 22. How to get the day of month, week number, day of year and day of week from a series of date strings?
Difficiulty Level: L2 Get the day of month, week number, day of year and day of week from ser. Input

Desired output
Date:  [1, 2, 3, 4, 5, 6]
Week number:  [53, 5, 9, 14, 19, 23]
Day num of year:  [1, 33, 63, 94, 125, 157]
Day of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

In [241]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [246]:
ser = pd.to_datetime(ser)

In [248]:
ser

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [266]:
print("Date: " + str(list(ser.dt.day)) + 
      "\nWeek number: " + str(list(ser.dt.isocalendar().week)) + 
      "\nDay num of year: " + str(list(ser.dt.dayofyear)) + 
      "\nDay of Week: " + str(list(ser.dt.day_name())))

Date: [1, 2, 3, 4, 5, 6]
Week number: [53, 5, 9, 14, 19, 23]
Day num of year: [1, 33, 63, 94, 125, 157]
Day of Week: ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

### 23. How to convert year-month string to dates corresponding to the 4th day of the month?
Difficiulty Level: L2 Change ser to dates that start with 4th of the respective months. Input
Desired Output

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

In [267]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

In [272]:
pd.to_datetime(ser, format='%b %Y').dt.strftime('%Y-%m-04')

0    2010-01-04
1    2011-02-04
2    2012-03-04
dtype: object

In [273]:
import numpy as np
import pandas as pd
data = pd.DataFrame({'A':[3,np.nan,np.nan],
                  'B':[5,7,np.nan],
                  'C':[4,2,7]})
data

     A    B  C
0  3.0  5.0  4
1  NaN  7.0  2
2  NaN  NaN  7

In [274]:
data.dropna(axis=1, inplace=True)

In [275]:
data

   C
0  4
1  2
2  7

In [277]:
data.columns

Index(['C'], dtype='object')

### 24. How to filter words that contain atleast 2 vowels from a series?
Difficiulty Level: L3 From ser, extract words that contain atleast 2 vowels. Input

In [2]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [28]:
def func(x):
    k=0
    for i in range(len(x)):
        if x.lower()[i] in ['a', 'e', 'i', 'o', 'u']:
            k=k+1
    return k

In [29]:
func('uifkemcl')

3

In [30]:
l = []
for i in ser:
    if func(i)>=2:
        l.append(i)
l

['Apple', 'Orange', 'Money']

### 25. How to filter valid emails from a series?
Difficiulty Level: L3 Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference. Input
Desired Output

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

In [31]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

In [36]:
emails[emails.str.contains(pattern, regex = True)]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object